[
  {
    "component": {
      "id": "550eab09-6e6a-4323-a5b5-1381135b50dd",
      "type": "filtered_ui_component",
      "name": "Actionable_Recommendation_Card",
      "tags": [
        "Recommendations",
        "Actionable",
        "Information Display",
        "Decision Support"
      ],
      "screen_hints": [
        "Dashboard",
        "Recommendation Feed",
        "Notifications Panel"
      ],
      "logic_notes": "Each card represents a single recommendation. The content (title, explanation, actions) should be dynamically populated based on the recommendation data. The primary action should lead to a relevant screen or trigger an immediate action. The secondary action should allow users to manage or dismiss the recommendation. The component should be designed for scannability and quick comprehension, ensuring users can understand and act on recommendations efficiently.",
      "structure": {
        "type": "Card",
        "components": [
          {
            "type": "Text",
            "role": "Recommendation title or summary"
          },
          {
            "type": "Text",
            "role": "Brief explanation or benefit of the recommendation"
          },
          {
            "type": "Button",
            "role": "Primary call to action (e.g., 'View Details', 'Apply')"
          },
          {
            "type": "Button",
            "role": "Secondary action (e.g., 'Dismiss', 'Not Interested')"
          },
          {
            "type": "Icon",
            "role": "Visual indicator of recommendation type or urgency"
          }
        ]
      },
      "status": "active",
      "description": [
        "Presents individual recommendations in a clear, concise, and actionable format.",
        "Highlights key information to facilitate quick decision-making.",
        "Provides direct options for users to act upon or dismiss recommendations."
      ]
    }
  },
  {
    "component": {
      "id": "5056e330-4576-4d5d-a36b-998f886113b7",
      "type": "filtered_ui_component",
      "name": "UnnamedComponent",
      "tags": [],
      "screen_hints": [],
      "logic_notes": "",
      "structure": {},
      "status": "active",
      "description": []
    }
  },
  {
    "component": {
      "id": "6407ac44-e730-41e4-a85c-b7cbde686fa5",
      "type": "filtered_ui_component",
      "name": "Weather_Based_Insights___Recommendations",
      "tags": [
        "Weather",
        "Recommendations",
        "Activities",
        "Clothing",
        "Planning",
        "Personalization",
        "Health",
        "Safety"
      ],
      "screen_hints": [
        "Dashboard",
        "Recommendation Feed",
        "Daily Forecast Detail View"
      ],
      "logic_notes": "This component consumes daily and hourly weather forecast data, along with relevant health and environmental data (e.g., UV index, pollen counts). It applies predefined rules or algorithms to generate activity recommendations (e.g., suggesting outdoor walks if temperature is within a comfortable range and no precipitation). It generates clothing recommendations based on temperature, precipitation, and wind chill. It analyzes hourly forecasts to identify optimal time windows for specific activities based on weather suitability. Crucially, it also generates health and safety insights, such as warnings for high UV index or allergy alerts, based on the forecast data. Recommendations and insights should be dynamic and update with changing weather conditions and relevant data. The component should be able to integrate with existing weather forecast data sources and potentially external health/environmental data APIs.",
      "structure": {
        "type": "Section",
        "components": [
          {
            "type": "Text",
            "role": "Outdoor activity recommendation (e.g., 'Good day for a walk')"
          },
          {
            "type": "Text",
            "role": "Clothing recommendation (e.g., 'Light jacket recommended')"
          },
          {
            "type": "Text",
            "role": "Best time for activity recommendation (e.g., 'Best time for outdoor activities: 2 PM - 5 PM')"
          },
          {
            "type": "Text",
            "role": "Health and safety insight (e.g., 'High UV index, use sunscreen')"
          },
          {
            "type": "Icon",
            "role": "Visual cue related to the recommendation or insight (e.g., sun, umbrella, jacket, warning sign)"
          }
        ]
      },
      "status": "active",
      "description": [
        "Provides recommendations for outdoor activities based on the day's weather.",
        "Offers clothing suggestions tailored to daily temperature and conditions.",
        "Recommends optimal times for specific activities based on the hourly forecast.",
        "Provides insights related to health and safety (e.g., 'High UV index, use sunscreen', 'Allergy alert') based on the daily forecast."
      ]
    }
  },
  {
    "component": {
      "id": "81d6391b-422f-4124-9381-e17631b553c3",
      "type": "filtered_ui_component",
      "name": "City_Weather_Forecast",
      "tags": [
        "Weather",
        "Search",
        "Location",
        "Forecast",
        "Display"
      ],
      "screen_hints": [
        "Daily Forecast Detail View"
      ],
      "logic_notes": "This component provides a search interface for users to input city names globally. Upon a successful search or selection from saved locations, it fetches and prominently displays the name of that specific city along with its current weather and a 7-day forecast. The forecast includes daily high/low temperatures and weather conditions. Users can save the currently viewed city to their list of preferred locations. Error handling is in place for invalid or unfindable city searches, and the location name is always clearly visible to ensure the user knows which city's weather they are viewing.",
      "structure": {
        "type": "Section",
        "components": [
          {
            "type": "Input",
            "role": "City search input field"
          },
          {
            "type": "Button",
            "role": "Search button"
          },
          {
            "type": "Text",
            "role": "Prominently display current location name (e.g., 'Forecast for [City Name]')"
          },
          {
            "type": "List",
            "role": "Display 7-day forecast (e.g., daily cards)"
          },
          {
            "type": "Text",
            "role": "Daily high/low temperature"
          },
          {
            "type": "Icon",
            "role": "Weather condition icon for each day"
          },
          {
            "type": "Button",
            "role": "Save location to preferred list"
          }
        ]
      },
      "status": "active",
      "description": [
        "Enables users to search for weather conditions in any city worldwide.",
        "Displays the name of the location for which the 7-day forecast is currently displayed.",
        "Presents a 7-day forecast for the selected or searched city, including daily high/low temperatures and weather conditions."
      ]
    }
  },
  {
    "component": {
      "id": "6e0c6633-646a-4296-a4f5-488be08619ee",
      "type": "filtered_ui_component",
      "name": "Location_Management_and_Guidance",
      "tags": [
        "Privacy",
        "Location",
        "Permissions",
        "Settings",
        "Onboarding",
        "Guidance",
        "Error Handling"
      ],
      "screen_hints": [
        "Settings Screen",
        "Privacy Settings",
        "Initial Setup/Onboarding"
      ],
      "logic_notes": "This component allows users to control the app's access to their device's location services. Toggling the permission should directly reflect the app's ability to use location data. It should provide clear information on why location is requested and how it's used, potentially linking to a detailed privacy policy. For platforms where direct app-level permission revocation is not possible, it should guide the user to the device's system settings for location permissions. The component should dynamically update its state based on the current permission status and the availability of location services. When location services are detected as disabled at the system level, a clear guidance message should be displayed, prompting the user to enable them. This message should include an actionable button or link that directs the user to the device's system location settings. Crucially, if the app attempts to automatically determine the user's location and fails (e.g., due to GPS issues, no network, or permission denied), a distinct informative message should be displayed. This message should explain the failure and offer alternative actions, such as prompting the user to manually search for a city.",
      "structure": {
        "type": "Section",
        "components": [
          {
            "type": "Toggle",
            "role": "Enable/Disable app's location access"
          },
          {
            "type": "Text",
            "role": "Explanation of location data usage and privacy policy link"
          },
          {
            "type": "Button",
            "role": "Link to system-level location settings (if applicable)"
          },
          {
            "type": "Message",
            "role": "Guidance message when location services are disabled at the system level"
          },
          {
            "type": "Button",
            "role": "Action to open system location settings (if applicable)"
          },
          {
            "type": "Message",
            "role": "Error message when automatic location determination fails"
          },
          {
            "type": "Button",
            "role": "Action to manually search for a location"
          }
        ]
      },
      "status": "active",
      "description": [
        "Provides users with controls to manage and revoke location permissions for the application.",
        "Informs users about the implications of granting or revoking location access.",
        "Guides users on how to enable location services if they are disabled at the system level, to utilize automatic location detection.",
        "Informs users if their location cannot be automatically determined, explaining why and suggesting alternative actions like manual search."
      ]
    }
  },
  {
    "component": {
      "id": "90b59a5f-f6e9-42e7-8722-dcf7dbe14d16",
      "type": "filtered_ui_component",
      "name": "Preferred_Locations_Manager",
      "tags": [
        "Weather",
        "Location Management",
        "Favorites",
        "Persistence",
        "Reordering"
      ],
      "screen_hints": [
        "Daily Forecast Detail View",
        "Saved Locations Screen"
      ],
      "logic_notes": "Users can save the currently viewed location to a persistent list. The component dynamically displays this list of saved locations. Selecting a saved location navigates the user to its detailed weather forecast. Users can remove individual locations from the list. The list should update dynamically upon saving or removing locations. Users can also reorder the list of saved locations. All changes to the list, including additions, removals, and reordering, must persist across app sessions (i.e., remembered even after closing and reopening).",
      "structure": {
        "type": "Section",
        "components": [
          {
            "type": "Button",
            "role": "Save current location"
          },
          {
            "type": "List",
            "role": "Display saved locations"
          },
          {
            "type": "Text",
            "role": "Location name in list item"
          },
          {
            "type": "Button",
            "role": "Remove location from list"
          },
          {
            "type": "Button",
            "role": "Select location to view details"
          },
          {
            "type": "Icon",
            "role": "Drag handle or reorder control for list items"
          }
        ]
      },
      "status": "active",
      "description": [
        "Manages a list of preferred locations, allowing users to save, view, remove, and reorder entries.",
        "Provides quick access to detailed weather forecasts for saved locations.",
        "Ensures all changes to the list (additions, removals, reordering) persist across app sessions."
      ]
    }
  }
]